Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If IdToken does not provide enough information about the currently authenticated user then you can set a `quarkus.oidc.authentication.user-info-required=true` property for a https://openid.net/specs/openid-connect-core-1_0.html#UserInfo[UserInfo] JSON object from the OIDC userinfo endpoint to be requested.
ja_jp: IdTokenが現在認証されているユーザーに関する十分な情報を提供しない場合は、 `quarkus.oidc.authentication.user-info-required=true` プロパティーを設定することで OIDC の userinfo エンドポイントから link:https://openid.net/specs/openid-connect-core-1_0.html#UserInfo[UserInfo] JSON オブジェクトを要求することができます。

source: If JBang has already been installed, you can directly use it:
ja_jp: JBang がすでにインストールされている場合は、直接使用できます。

source: If Keycloak does enforce it then you will see an authentication error informing you that the `redirect_uri` value is wrong.
ja_jp: Keycloak がそれを強制する場合は、 `redirect_uri` 値が間違っていることを通知する認証エラーが表示されます。

source: If Keycloak enforces it, you see an authentication error informing you that the `redirect_uri` value is wrong.
ja_jp: Keycloak がそれを強制する場合、`redirect_uri` 値が間違っていることを通知する認証エラーが表示されます。

source: If Mockito doesn't meet your needs, you can create a mock programmatically using `QuarkusMock`, e.g.:
ja_jp: Mockito がニーズを満たさない場合は、 `QuarkusMock` を使用してプログラムでモックを作成できます。例:

source: If Proof Key for Code Exchange (PKCE) is required
ja_jp: Proof Key for Code Exchange (PKCE) が必須かどうか

source: If Quarkus does not provide a JDBC extension for your database, or you need to use a different JDBC driver, such as one for OpenTelemetry, you can configure the JDBC driver explicitly.
ja_jp: Quarkus がデータベース用の JDBC エクステンションを提供していない場合、または OpenTelemetry 用などの別の JDBC ドライバーを使用する必要がある場合は、JDBC ドライバーを明示的に設定できます。

source: If Quarkus starts the HTTP server in DEV mode after a failed start, Quarkus may need to fallback to the configuration provided in the `application.properties` file. This is a known limitation.
ja_jp: Quarkus が起動に失敗した後、開発モードで HTTP サーバーを起動した場合、Quarkus は `application.properties` ファイルで提供されている設定にフォールバックする必要がある場合があります。これは既知の制限です。

source: If REST Assured is used for testing and `quarkus.http.root-path` is set then Quarkus will automatically configure the base URL for use in Quarkus tests, so test URL's should not include the root path.
ja_jp: テストに REST Assured を使用し、`quarkus.http.root-path` が設定されている場合、Quarkus は自動的に Quarkus テストで使用するためのベース URL を設定します。そのため、テストの URL はルートパスには含めないでください。

source: If Section
ja_jp: セクションの場合

source: If UserInfo is required
ja_jp: UserInfo が必須かどうか

source: If UserInfo is the source of the roles then set `quarkus.oidc.authentication.user-info-required=true` and `quarkus.oidc.roles.source=userinfo`, and if needed, `quarkus.oidc.roles.role-claim-path`.
ja_jp: UserInfoがロールのソースである場合は、 `quarkus.oidc.authentication.user-info-required=true` と `quarkus.oidc.roles.source=userinfo` 、必要に応じて `quarkus.oidc.roles.role-claim-path` を設定します。

source: If UserInfo is the source of the roles, then set `quarkus.oidc.roles.source=userinfo`, and if needed, `quarkus.oidc.roles.role-claim-path`.
ja_jp: UserInfo がロールのソースである場合は、 `quarkus.oidc.roles.source=userinfo` を設定し、必要に応じて `quarkus.oidc.roles.role-claim-path` を設定します。

source: If XA cannot be enabled for one of your datasources:
ja_jp: 1 つのデータソースに対して XA を有効にできない場合:

source: If `@CircuitBreaker` is used with `@RateLimit`, the circuit breaker is checked before enforcing the rate limit. If rate limiting results in `RateLimitException`, this may be counted as a failure, depending on how the circuit breaker is configured.
ja_jp: `@CircuitBreaker` を `@RateLimit` と一緒に使用すると、流量制御を適用する前にサーキットブレーカーがチェックされます。レート制限によって `RateLimitException` が発生した場合、サーキットブレーカーの設定によっては、失敗としてカウントされることがあります。

source: If `@Fallback` is used with `@RateLimit`, the fallback method or handler may be invoked if a `RateLimitException` is thrown, depending on the fallback configuration.
ja_jp: `@Fallback` が `@RateLimit` とともに使用される場合、フォールバック設定に応じて、`RateLimitException` が出力されると、フォールバックメソッドまたはハンドラーが呼び出されることがあります。

source: If `@QuarkusComponentTest#addNestedClassesAsComponents()` is set to `true` (default) then all static nested classes declared on the test class are components too.
ja_jp: `@QuarkusComponentTest#addNestedClassesAsComponents()` が `true` (デフォルト) に設定されている場合、テストクラスで宣言されたすべてのネストされた静的クラスもコンポーネントになります。

source: If `@Retry` is used with `@RateLimit`, each retry attempt is processed by the rate limit as an independent invocation. If `RateLimitException` is thrown, the execution may be retried, depending on how the retry is configured.
ja_jp: `@Retry` を `@RateLimit` と一緒に使用すると、各再試行はレート制限によって独立した呼び出しとして処理されます。`RateLimitException` が出力された場合、再試行の設定方法に応じて実行が再試行されることがあります。

source: If `@Scheduled#delay()` is set to a value greater than zero the value of `@Scheduled#delayed()` is ignored.
ja_jp: `@Scheduled#delay()` がゼロよりも大きい値に設定されている場合、 `@Scheduled#delayed()` の値は無視されます。

source: If `@TemplateData#namespace()` is set to a non-empty value then a namespace resolver is automatically generated to access the public static fields and methods of the target class. By default, the namespace is the FQCN of the target class where dots and dollar signs are replaced by underscores. For example, the namespace for a class with name `org.acme.Foo` is `org_acme_Foo`. The static field `Foo.AGE` can be accessed via `{org_acme_Foo:AGE}`. The static method `Foo.computeValue(int number)` can be accessed via `{org_acme_Foo:computeValue(10)}`.
ja_jp: `@TemplateData#namespace()` が空でない値に設定されている場合、ターゲットクラスのパブリック静的フィールドとメソッドにアクセスする名前空間リゾルバーが自動的に生成されます。 デフォルトでは、名前空間はターゲットクラスの FQCN で、ドットやドル記号はアンダースコアに置き換えられます。 たとえば、名前 `org.acme.Foo` を持つクラスの名前空間は `org_acme_Foo` です。 静的フィールド `Foo.AGE` には、`{org_acme_Foo:AGE}` からアクセスすることができます。 静的メソッド `Foo.computeValue(int number)` には、`{org_acme_Foo:computeValue(10)}` を介してアクセスできます。

source: If `TemplateExtension#namespace()` is specified then the extension method is used to resolve expressions with the given <<expressions,namespace>>. Template extension methods that share the same namespace are grouped in one resolver ordered by `TemplateExtension#priority()`. The first matching extension method is used to resolve an expression.
ja_jp: `TemplateExtension#namespace()` が指定されている場合、拡張メソッドが、指定された <<expressions,namespace>> を持つ式を解決するために使用されます。 同じ名前空間を共有するテンプレートのエクステンションメソッドは、`TemplateExtension#priority()` で順に 1 つのリゾルバーにグループ化されます。 最初にマッチするエクステンションメソッドが式の解決に使用されます。

source: If `UserInfo` is the source of the roles, then set `quarkus.oidc.authentication.user-info-required=true` and `quarkus.oidc.roles.source=userinfo`, and if needed, set `quarkus.oidc.roles.role-claim-path`.
ja_jp: `UserInfo` がロールのソースである場合は、 `quarkus.oidc.authentication.user-info-required=true` および `quarkus.oidc.roles.source=userinfo` を設定し、必要に応じて `quarkus.oidc.roles.role-claim-path` を設定します。

source: If `api-version` is not set, the latest version for the given flavor will be used. Otherwise, the version must match a https://github.com/dajudge/kindcontainer/blob/master/k8s-versions.json[version supported by the given flavor].
ja_jp: `api-version` が設定されていない場合は、与えられた flavor の最新版が使用されます。それ以外の場合は、 link:https://github.com/dajudge/kindcontainer/blob/master/k8s-versions.json[定められた flavor がサポート] するバージョンと一致しなければなりません。

source: If `autoUpdatePartitions` is enabled, a consumer subscribes to partition increase automatically. **Note**: this is only for partitioned consumers.
ja_jp: `autoUpdatePartitions` が有効な場合、コンシューマーは自動的にパーティションの増加に加入します。

source: If `client_secret_jwt`, `private_key_jwt` authentication methods are used or an Apple `post_jwt` method is used then the JWT signature algorithm, key identifier, audience, subject and issuer can be customized, for example:
ja_jp: `client_secret_jwt` または `private_key_jwt` のいずれかの認証方法を使用する場合、Apple `post_jwt` メソッドは JWT 署名アルゴリズム、鍵識別子、オーディエンス、サブジェクト、および発行者をカスタマイズすることができます。以下に例を示します。

source: If `client_secret_jwt`, `private_key_jwt` authentication methods are used or an Apple `post_jwt` method is used, then the JWT signature algorithm, key identifier, audience, subject and issuer can be customized, for example:
ja_jp: `client_secret_jwt` , `private_key_jwt` の認証方式を使用する場合、または Apple の `post_jwt` 方式を使用する場合、JWT 署名アルゴリズム、鍵識別子、オーディエンス、サブジェクト、発行者などをカスタマイズすることができます:

source: If `client_secret_jwt`, `private_key_jwt` authentication methods are used or an `Apple` `post_jwt` method is used then the JWT signature algorithm, key identifier, audience, subject and issuer can be customized, for example:
ja_jp: `client_secret_jwt` , `private_key_jwt` 認証方式が使用される場合、または `Apple` `post_jwt` 認証方式が使用される場合、JWT 署名アルゴリズム、キー識別子、オーディエンス、サブジェクト、発行者は、例えば、カスタマイズ可能です:

source: If `client_secret_jwt`, `private_key_jwt`, or an Apple `post_jwt` authentication method is used, then you can customize the JWT signature algorithm, key identifier, audience, subject, and issuer.
ja_jp: `client_secret_jwt`、 `private_key_jwt`、または Apple `post_jwt` 認証メソッドを使用する場合は、JWT 署名アルゴリズム、キー識別子、オーディエンス、サブジェクト、および発行者をカスタマイズできます。

source: If `client_secret_jwt`, `private_key_jwt`, or an Apple `post_jwt` authentication methods are used, then you can customize the JWT signature algorithm, key identifier, audience, subject and issuer. For example:
ja_jp: `client_secret_jwt` 、 `private_key_jwt` 、またはAppleの `post_jwt` 認証方法が使用されている場合、JWT署名アルゴリズム、キー識別子、audience、subject、およびissuerをカスタマイズすることができます。 例:

source: If `groups` claim is available then its value is used
ja_jp: `groups` クレームが利用可能な場合は、その値が使用されます。

source: If `kafka-configuration` is set and no `Map` can be found, the deployment fails.
ja_jp: `kafka-configuration` が設定されていて、 `Map` が見つからない場合、デプロイメントは失敗します。

source: If `proxy-address` is not set for the client but is set on the global level, the client uses the global settings. Otherwise, the client uses the JVM settings.
ja_jp: クライアントに `proxy-address` が設定されていないが、グローバルレベルで設定されている場合、クライアントはグローバル設定を使用します。それ以外の場合、クライアントは JVM 設定を使用します。

source: If `proxy-address` is set on the client level, the client uses its specific proxy settings. No proxy settings are propagated from the global configuration or JVM properties.
ja_jp: `proxy-address` がクライアントレベルで設定されている場合、クライアントは特定のプロキシー設定を使用します。プロキシー設定は、グローバル設定または JVM プロパティーから伝播されません。

source: If `quarkus-extension-b` wasn't declared as `<optional>true</optional>` that would make `quarkus-extension-b` a required dependency of `quarkus-extension-a` and its dependency condition would be ignored.
ja_jp: もし `quarkus-extension-b` が `<optional>true</optional>` として宣言されていなければ、 `quarkus-extension-b` は `quarkus-extension-a` の必須の依存関係となり、その依存関係の条件は無視されます。

source: If `quarkus.native.compression.container-image` is not set explicitly, it will implicitly default to `quarkus.native.builder-image`.
ja_jp: `quarkus.native.compression.container-image` が明示的に設定されていない場合、暗黙的に `quarkus.native.builder-image` がデフォルトとなります。

source: If `quarkus.oidc.auth-server-url` is already set then a generic OpenID Connect Dev Console which can be used with all OpenID Connect providers may be activated, please see <<dev-ui-all-oidc-providers,Dev UI for all OpenID Connect Providers>> for more information.
ja_jp: `quarkus.oidc.auth-server-url` がすでに設定されている場合は、すべての OpenIDConnect プロバイダーで使用できる汎用 OpenIDConnectDevConsole がアクティブ化されます。詳細は <<dev-ui-all-oidc-providers,Dev UI for all OpenID Connect Providers>> を参照してください。

source: If `quarkus.oidc.auth-server-url` is already set then a generic OpenID Connect Dev Console which can be used with all OpenID Connect providers may be activated, please see xref:dev-ui-all-oidc-providers[Dev UI for all OpenID Connect Providers] for more information.
ja_jp: `quarkus.oidc.auth-server-url` が設定されている場合、すべての OpenID Connect プロバイダーで使用できる一般的な OpenID Connect Dev Console が有効になります。詳細については、 xref:dev-ui-all-oidc-providers[すべての OpenID Connect プロバイダーの Dev UI] を参照してください。

source: If `quarkus.oidc.auth-server-url` is already set then a generic OpenID Connect Dev Console which can be used with all OpenID Connect providers will be activated, please see <<dev-ui-all-oidc-providers,Dev UI for all OpenID Connect Providers>> for more information.
ja_jp: `quarkus.oidc.auth-server-url` がすでに設定されている場合は、すべての OpenIDConnect プロバイダーで使用できる汎用 OpenIDConnectDevConsole がアクティブ化されます。詳細は <<dev-ui-all-oidc-providers,すべての OpenID Connect プロバイダーの Dev UI>> を参照してください。

source: If `quarkus.oidc.auth-server-url` is already set then a generic OpenID Connect Dev Console which can be used with all OpenID Connect providers will be activated, please see xref:dev-ui-all-oidc-providers[Dev UI for all OpenID Connect Providers] for more information.
ja_jp: `quarkus.oidc.auth-server-url` が設定されている場合、すべての OpenID Connect プロバイダーで使用できる一般的な OpenID Connect Dev Console が有効になります。詳細は、 xref:dev-ui-all-oidc-providers[すべての OpenID Connect プロバイダーの Dev UI] を参照してください。

source: If `quarkus.oidc.auth-server-url` is already set, then a generic OpenID Connect Dev Console, which can be used with all OpenID Connect providers, can be activated. For more information, see the <<dev-ui-all-oidc-providers,Dev UI for all OpenID Connect providers>> section.
ja_jp: `quarkus.oidc.auth-server-url` がすでに設定されている場合は、すべての OpenID Connect プロバイダーで使用できる汎用の OpenID Connect Dev Console をアクティブ化できます。詳細は、<<dev-ui-all-oidc-providers,Dev UI for all OpenID Connect providers>> セクションを参照してください。

source: If `quarkus.oidc.auth-server-url` is already set, then a generic OpenID Connect Dev Console, which can be used with all OpenID Connect providers, is activated. For more information, see <<dev-ui-all-oidc-providers,Dev UI for all OpenID Connect providers>>.
ja_jp: `quarkus.oidc.auth-server-url` がすでに設定されている場合、すべての OpenID Connect プロバイダーで使用できる汎用の OpenID Connect Dev Console がアクティブになります。 詳細は、<<dev-ui-all-oidc-providers,Dev UI for all OpenID Connect providers>> を参照してください。

source: If `quarkus.oidc.auth-server-url` points to an already started OpenID Connect provider (which can be Keycloak or other provider), `quarkus.oidc.auth-server-url` is set to `service` (which is a default value) and at least `quarkus.oidc.client-id` is set then `Dev UI for all OpenID Connect Providers` will be activated.
ja_jp: `quarkus.oidc.auth-server-url` が、すでに起動されている OpenID Connect プロバイダー (Keycloak または他のプロバイダーも可) を指し、 `quarkus.oidc.auth-server-url` が `service` (デフォルト値) に設定され、少なくとも `quarkus.oidc.client-id` が設定されている場合、すべての OpenID Connect プロバイダーの Dev UI (`Dev UI for all OpenID Connect Providers`) がアクティブになります。

source: If `quarkus.oidc.authentication.cookie-path-header` is set but no configured HTTP header is available in the current request then the `quarkus.oidc.authentication.cookie-path` will be checked.
ja_jp: `quarkus.oidc.authentication.cookie-path-header` が設定されているが、現在のリクエストで設定された HTTP ヘッダーが利用できない場合は、 `quarkus.oidc.authentication.cookie-path` がチェックされます。

source: If `quarkus.oidc.authentication.cookie-path-header` is set but no configured HTTP header is available in the current request, then the `quarkus.oidc.authentication.cookie-path` will be checked.
ja_jp: `quarkus.oidc.authentication.cookie-path-header` が設定されているが、現在のリクエストで設定された HTTP ヘッダーが利用できない場合は、 `quarkus.oidc.authentication.cookie-path` がチェックされます。

source: If `quarkus.oidc.authentication.redirect-path` is set but the original request URL has to be restored after the user has been redirected back to a callback URL such as `http://localhost:8080/service/callback` then a `quarkus.oidc.authentication.restore-path-after-redirect` property has to be set to `true` which will restore the request URL such as `http://localhost:8080/service/1`, etc.
ja_jp: `quarkus.oidc.authentication.redirect-path` が設定されているが、ユーザーが `http://localhost:8080/service/callback` などのコールバック URL にリダイレクトされた後、元のリクエスト URL を復元する必要がある場合 `quarkus.oidc.authentication.restore-path-after-redirect` プロパティーを `true` に設定する必要があります。これにより、 `http://localhost:8080/service/1` などのリクエスト URL が復元されます。

source: If `quarkus.oidc.authentication.redirect-path` is set, but you need the original request URL to be restored after the user is redirected back to a unique callback URL, for example, `http://localhost:8080/service/callback`, set `quarkus.oidc.authentication.restore-path-after-redirect` property to `true`. This will restore the request URL such as `http://localhost:8080/service/1`.
ja_jp: `quarkus.oidc.authentication.redirect-path` が設定されているが、ユーザーが `http://localhost:8080/service/callback` などの一意のコールバック URL にリダイレクトされた後に元のリクエスト URL を復元する必要がある場合は、 `quarkus.oidc.authentication.restore-path-after-redirect` プロパティーを `true` に設定します。 これにより、 `http://localhost:8080/service/1` などのリクエスト URL が復元されます。

source: If `quarkus.oidc.authentication.redirect-path` is set, but you need the original request URL to be restored after the user is redirected back to a unique callback URL, for example, `http://localhost:8080/service/callback`, set `quarkus.oidc.authentication.restore-path-after-redirect` property to `true`. This will restore the request URL, such as `http://localhost:8080/service/1`.
ja_jp: `quarkus.oidc.authentication.redirect-path` が設定されているが、ユーザーが `http://localhost:8080/service/callback` などの一意のコールバック URL にリダイレクトされた後に元のリクエスト URL を復元する必要がある場合は、 `quarkus.oidc.authentication.restore-path-after-redirect` プロパティーを `true` に設定します。 これにより、 `http://localhost:8080/service/1` などのリクエスト URL が復元されます。

source: If `quarkus.oidc.roles.role-claim-path` property is set and matching array or string claims are found then the roles are extracted from these claims. For example, `customroles`, `customroles/array`, `scope`, `"http://namespace-qualified-custom-claim"/roles`, `"http://namespace-qualified-roles"`, etc.
ja_jp: `quarkus.oidc.roles.role-claim-path` プロパティーが設定されており、一致する配列または文字列のクレームが見つかった場合、このクレームからロールが抽出されます。例えば、 `customroles`、 `customroles/array`、 `scope`、 `"http://namespace-qualified-custom-claim"/roles`、 `"http://namespace-qualified-roles"` などです。

source: If `quarkus.scheduler.tracing.enabled` is set to `true` and the xref:opentelemetry.adoc[OpenTelemetry extension] is present then every job execution, either defined with the `@Scheduled` annotation or scheduled programmatically, automatically creates a span named after the job's <<identity>>.
ja_jp: `quarkus.scheduler.tracing.enabled` を `true` に設定し、xref:opentelemetry.adoc[OpenTelemetry エクステンション] が存在する場合、 `@Scheduled` アノテーションで定義されているか、プログラムでスケジュールされているかに関係なく、ジョブの <<identity>> をもとにした名前でスパンが自動的に作成されます。

source: If `quarkus.scheduler.tracing.enabled` is set to `true` and the xref:opentelemetry.adoc[OpenTelemetry extension] is present then the `@io.opentelemetry.instrumentation.annotations.WithSpan` annotation is added automatically to every `@Scheduled` method. As a result, each execution of this method has a new `io.opentelemetry.api.trace.Span` associated.
ja_jp: `quarkus.scheduler.tracing.enabled` が `true` に設定され、 link:opentelemetry.html[OpenTelemetry] エクステンションが存在する場合、 `@io.opentelemetry.instrumentation.annotations.WithSpan` アノテーションはすべての `@Scheduled` メソッドに自動的に追加されます。その結果、このメソッドの各実行には、新しい `io.opentelemetry.api.trace.Span` が関連付けられます。

source: If `quarkus.scheduler.use-composite-scheduler=true` is set then this method will be executed with the simple in-memory implementation provided by the `quarkus-scheduler` extension.
ja_jp: `quarkus.scheduler.use-composite-scheduler=true` が設定されている場合、このメソッドは `quarkus-scheduler` エクステンションによって提供される単純なインメモリー実装を使用して実行されます。

source: If `realm_access/roles` or `resource_access/client_id/roles` (where `client_id` is the value of the `quarkus.oidc.client-id` property) claim is available then its value is used. This check supports the tokens issued by Keycloak
ja_jp: `realm_access/roles` または `resource_access/client_id/roles` (ここで `client_id` は `quarkus.oidc.client-id` プロパティーの値)クレームが利用可能な場合は、その値が使用されます。このチェックは、Keycloakが発行するトークンをサポートします。

source: If `replicateSubscriptionState` is enabled, a subscription state is replicated to geo-replicated clusters.
ja_jp: `replicateSubscriptionState` が有効な場合、サブスクリプションの状態は地理的に複製されたクラスタに複製されます。

source: If `scan-exclude-profiles` is configured: operations are *excluded* if any of their profiles match.
ja_jp: `scan-exclude-profiles` が設定されている場合: いずれかのプロファイルが一致すると、オペレーションは *除外* されます。

source: If `scan-profiles` is configured and `scan-exclude-profiles` is *not* configured: operations are *included* only if at least one profile matches the `scan-profiles`.
ja_jp: `scan-profiles` が設定され、`scan-exclude-profiles` が設定されて *いない* 場合: 少なくとも 1 つのプロファイルが `scan-profiles` と一致する場合にのみ、オペレーションは *含まれます*。

source: If `smallrye.jwt.sign.key.location` or/and `smallrye.jwt.encrypt.key.location` properties are set then one can secure the existing claims (resources, maps, JsonObjects) with a single call:
ja_jp: `smallrye.jwt.sign.key.location` や `smallrye.jwt.encrypt.key.location` プロパティーが設定されている場合、既存のクレーム (リソース、マップ、JsonObjects) を 1 回の呼び出しで保護できます。

source: If `username` and `password` are explicitly configured, they are used.
ja_jp: `username` と `password` が明示的に設定されている場合は、それらが使用されます。

source: If a CDI scope is declared on a key generator class and if that class has a default qualifier (no qualifier annotation or `@jakarta.enterprise.inject.Default`), then the key generator will be injected as a CDI bean during the cache key computation. Otherwise, the key generator will be instantiated using its default constructor. All CDI scopes supported by Quarkus can be used on a key generator.
ja_jp: CDIスコープがキージェネレータークラス上で宣言され，そのクラスがデフォルト修飾子(修飾子アノテーション又は `@jakarta.enterprise.inject.Default` )をもつ場合，鍵生成器は，キャッシュ鍵計算の間にCDI Beanとして注入されることになる。そうでない場合、鍵生成器は、そのデフォルトコンストラクタを使用してインスタンス化される。QuarkusがサポートするすべてのCDIスコープは、キー・ジェネレーターで使用することができます。

source: If a CDI scope is declared on a key generator class and if that class has a default qualifier (no qualifier annotation or `@javax.enterprise.inject.Default`), then the key generator will be injected as a CDI bean during the cache key computation. Otherwise, the key generator will be instantiated using its default constructor. All CDI scopes supported by Quarkus can be used on a key generator.
ja_jp: CDIスコープが、キージェネレータクラスで宣言され、そのクラスがデフォルトの修飾子を持つ場合 (修飾子アノテーションまたは `@javax.enterprise.inject.Default` がない場合)、 キージェネレータはキャッシュキー計算中に CDI Beanとしてインジェクトされます。そうでない場合は、そのデフォルトのコンストラクタを使用して、キージェネレータがインスタンス化されます。Quarkus がサポートするすべての CDI スコープは、キージェネレーターで使用できます。

source: If a CI system was detected
ja_jp: CIシステムが検出されるか

source: If a DTO used in a projection has multiple constructors and is not properly annotated, it may lead to *unexpected behavior*.
ja_jp: 射影で使用される DTO に複数のコンストラクターがあり、適切にアノテーションが付けられていない場合、*予期しない動作* を引き起こす可能性があります。

source: If a Mongo Client is not active:
ja_jp: Mongo クライアントがアクティブでない場合:

source: If a Redis Client is not active:
ja_jp: Redis クライアントがアクティブでない場合。

source: If a `client.id` is not provided, it is generated as `[client-id-prefix][channel-name][-index]`.
ja_jp: `client.id` が指定されていない場合、 `[client-id-prefix][channel-name][-index]`. として生成されます。

source: If a `client.id` is not provided, it is generated as `kafka-consumer-[channel][-index]`.
ja_jp: `client.id` が指定されていない場合、 `kafka-consumer-[channel][-index]` として生成されます。

source: If a `client.id` is provided, it is used as-is or suffixed with client index if `partitions` property is set.
ja_jp: `client.id` が指定されている場合は、そのまま使用されるか、 `partitions` プロパティーが設定されている場合はクライアントインデックスの接尾辞が付けられます。

source: If a `completed` log message is missing then you have a good candidate to explore.
ja_jp: もし、 `completed` のログメッセージがない場合は、調査すべき良い候補があります。

source: If a `groups` claim is available, then its value is used.
ja_jp: `groups` クレームが利用可能な場合は、その値が使用されます。

source: If a `realm_access/roles` or `resource_access/client_id/roles` (where `client_id` is the value of the `quarkus.oidc.client-id` property) claim is available, then its value is used. This check supports the tokens issued by Keycloak.
ja_jp: `realm_access/roles` または `resource_access/client_id/roles` (`client_id` は `quarkus.oidc.client-id` プロパティーの値) クレームが利用可能な場合は、その値が使用されます。 このチェックは、Keycloak が発行するトークンをサポートします。

source: If a `schema` is set by configuration, it won't be replaced by the auto-detection.
ja_jp: `schema` が設定されている場合、自動検出によって置き換えられることはありません。
